# 操作系统
- 常见类型 Windows，mac Os，Linux，iOS，Andriod
- 定义 系统软件，控制硬件和支持软件执行
- 作用 承上启下

# 虚拟机软件
- Vmware；VirtualBox

# Ubuntu界面
- Ubuntu是一个以桌面应用为主的Linux发行版操作系统
- 任务栏  
- 菜单窗口（窗口操作按钮，窗口菜单条）
- Windows多个盘符（根目录），Linux没有盘符概念，只有一个根目录 / 。
- Linux主要目录。 /home不同用户目录？？

# Linux内核和发行版
- 内核：OS内部操作和控制硬件设备的核心程序，OS是基于内核开发出来的
- 发行版：内核与常用软件的组合产品；常说的Linux操作系统。Ubuntu，CentOS，Redhat
- Linux操作系统是统称，单独说Linux严格指内核。

# 查看目录命令
（终端字体大小 Ctrl Shift + ；Ctrl - 。快速打开终端 Ctrl Alt T）
- ls 查看当前目录信息
- tree 以树状方式显示目录信息，||当前或下级
- pwd 查看当前目录路径
- clear 清除终端内容

# 切换目录命令
(切换时，目录必须存在)
- `cd 目录    切换到指定目录`
- `cd ~       切换到当前用户主目录（前面说过/home下面是不同用户目录）[ cd 等价cd ~ ]`
- `cd ..      上一级[ 上上级：cd ../.. ]`
- `cd .       当前`
- `cd -       上一次`

# 绝对路径和相对路径
- 绝对路径：从根目录算起 /home/python 根目录指` / `
- 相对路径：从当前目录 ./test；../static
- Tab按一次补全，两次提示查看
- 都不近建议使用绝对路径

# 创建、删除文件及目录
- `touch 文件名                    创建（文件名可无后缀，默认文本文件）  touch A/1.txt`
- `mkdir 目录名                    创建`
- `rm 文件名或目录名                删除（默认删文件；目录：rm AA -r 以递归方式删文件夹及里面内容`
- `rmdir 目录名                    删除(目录非空不能删`
